Австралия/src/DataProcessors/MappingGLAccountsToIncomeAndExpenseItems/MappingGLAccountsToIncomeAndExpenseItems.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>MappingGLAccountsToIncomeAndExpenseItems</name>
  <attributes>
    <name>UseDefaultTypeOfAccounting</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Mapping</name>
    <attributes>
      <name>GLAccount</name>
      <type>
        <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>IncomeAndExpenseItem</name>
      <type>
        <types>CatalogRef.IncomeAndExpenseItems</types>
      </type>
    </attributes>
    <attributes>
      <name>ViewDocuments</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Австралия/src/AccumulationRegisters/IncomeAndExpenses/IncomeAndExpenses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>IncomeAndExpenses</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>AmountIncome</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountExpense</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ContentOfAccountingRecord</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OfflineRecord</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BusinessLine</name>
    <type>
      <types>CatalogRef.LinesOfBusiness</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SalesOrder</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.WorkOrder</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IncomeAndExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/AccumulationRegisters/IncomeAndExpensesBudget/IncomeAndExpensesBudget.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>IncomeAndExpensesBudget</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>AmountIncome</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountExpense</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ContentOfAccountingRecord</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PlanningPeriod</name>
    <type>
      <types>CatalogRef.PlanningPeriods</types>
    </type>
  </dimensions>
  <dimensions>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BusinessLine</name>
    <type>
      <types>CatalogRef.LinesOfBusiness</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SalesOrder</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IncomeAndExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/InformationRegisters/FixedAssetParameters/FixedAssetParameters.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>FixedAssetParameters</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>AmountOfProductsServicesForDepreciationCalculation</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>CostForDepreciationCalculation</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ApplyInCurrentMonth</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </resources>
  <resources>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </resources>
  <resources>
    <name>BusinessLine</name>
    <type>
      <types>CatalogRef.LinesOfBusiness</types>
    </type>
  </resources>
  <resources>
    <name>UsagePeriodForDepreciationCalculation</name>
    <comment>Useful life</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>GLExpenseAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>FixedAsset</name>
    <type>
      <types>CatalogRef.FixedAssets</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/AccumulationRegisters/FinancialResult/FinancialResult.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>FinancialResult</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>AmountIncome</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountExpense</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ContentOfAccountingRecord</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BusinessLine</name>
    <type>
      <types>CatalogRef.LinesOfBusiness</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SalesOrder</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.WorkOrder</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IncomeAndExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/AccumulationRegisters/FinancialResultForecast/FinancialResultForecast.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>FinancialResultForecast</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>AmountIncome</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountExpense</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PlanningPeriod</name>
    <type>
      <types>CatalogRef.PlanningPeriods</types>
    </type>
  </dimensions>
  <dimensions>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BusinessLine</name>
    <type>
      <types>CatalogRef.LinesOfBusiness</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IncomeAndExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/InformationRegisters/CompensationPlan/CompensationPlan.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CompensationPlan</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>IncomeAndExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </resources>
  <resources>
    <name>Actuality</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>GLExpenseAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </dimensions>
  <dimensions>
    <name>EarningAndDeductionType</name>
    <type>
      <types>CatalogRef.EarningAndDeductionTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/InformationRegisters/WriteOffCostAdjustment/WriteOffCostAdjustment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>WriteOffCostAdjustment</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Quantity</name>
    <comment>Quantity</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Amount</name>
    <comment>Amount</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <dimensions>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
      <types>CatalogRef.ManufacturingActivities</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>InventoryAccountType</name>
    <type>
      <types>EnumRef.InventoryAccountTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Batch</name>
    <type>
      <types>CatalogRef.ProductsBatches</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ownership</name>
    <type>
      <types>CatalogRef.InventoryOwnership</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CostObject</name>
    <type>
      <types>CatalogRef.CostObjects</types>
    </type>
  </dimensions>
  <dimensions>
    <name>NodeNo</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/InformationRegisters/CounterpartiesGLAccounts/CounterpartiesGLAccounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CounterpartiesGLAccounts</name>
  <resources>
    <name>AccountsReceivable</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </resources>
  <resources>
    <name>AdvancesReceived</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </resources>
  <resources>
    <name>AccountsPayable</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </resources>
  <resources>
    <name>AdvancesPaid</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </resources>
  <resources>
    <name>DiscountAllowed</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </resources>
  <resources>
    <name>DiscountReceived</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </resources>
  <resources>
    <name>ThirdPartyPayer</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>TaxCategory</name>
    <type>
      <types>EnumRef.VATTaxationTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/InformationRegisters/MappingGLAccountsToIncomeAndExpenseItems/MappingGLAccountsToIncomeAndExpenseItems.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>MappingGLAccountsToIncomeAndExpenseItems</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>IncomeAndExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </resources>
  <dimensions>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/DataProcessors/MappingGLAccountsToIncomeAndExpenseItems/Forms/Form/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Not Users.RolesAvailable("FullRights") Then
		Cancel = True;
		Return;
	EndIf;
	
	If Constants.EachGLAccountIsMappedToIncomeAndExpenseItem.Get() = False Then
		AddPrefilledIncomeAndExpenseItems();
	EndIf;
	
	UseDefaultTypeOfAccounting = True;
	
	If Constants.EachGLAccountIsMappedToIncomeAndExpenseItem.Get() Then
		FillProfitEstimationMapping();
	Else
		FillMapping();
	EndIf;
	
	If Mapping.Count() = 0 Then
		Constants.EachGLAccountIsMappedToIncomeAndExpenseItem.Set(True);
		Constants.EachProfitEstimationGLAccountIsMappedToIncomeAndExpenseItem.Set(True);
		Cancel = True;
	EndIf;
	
	FormManagement();
	
EndProcedure

&AtClient
Procedure OnClose(Exit)
	
	If Exit Then
		Return;
	EndIf;
	
	SetConstantValues(UseDefaultTypeOfAccounting);
	
EndProcedure

#EndRegion

#Region FormTableItemsEventHandlers

&AtClient
Procedure MappingSelection(Item, SelectedRow, Field, StandardProcessing)
	
	If Field.Name = "MappingViewDocuments" Then
		
		CurrentData = Mapping.FindByID(SelectedRow);
		
		FormParameters = New Structure("VariantKey, Filter, GenerateOnOpen", 
			"Default", 
			New Structure("GLAccount", CurrentData.GLAccount), 
			True);
		
		OpenForm("Report.ProfitAndLossAccountRecorders.Form", FormParameters, , CurrentData.GLAccount);
		
	EndIf;
	
EndProcedure

&AtClient
Procedure MappingIncomeAndExpenseItemOnChange(Item)
	FormManagement();
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure ProcessDataCommand(Command)
	
	TimeConsuming = SaveMappingAtServer();
	IdleParameters = TimeConsumingOperationsClient.IdleParameters(ThisObject);
	IdleParameters.MessageText = NStr("en = 'Data processing...'; ru = 'Обработка данных...';pl = 'Przetwarzanie danych...';es_ES = 'Procesamiento de datos...';es_CO = 'Procesamiento de datos...';tr = 'Veri işleniyor...';it = 'Elaborazione dati...';de = 'Datenverarbeitung...'");
	
	NotifyDescription = New NotifyDescription("DataProcessedOnComletion", ThisObject);
	TimeConsumingOperationsClient.WaitForCompletion(TimeConsuming, NotifyDescription, IdleParameters);
	
EndProcedure

&AtClient
Procedure DataProcessedOnComletion(Result, AdditionParameters) Export
	
	If Result = Undefined Or Result.Status = "Canceled" Then
		Return;
	ElsIf Result.Status = "Error" Then
		CommonClientServer.MessageToUser(Result.BriefErrorPresentation);
	ElsIf Result.Status = "Completed" Then
		If IsEmptyDefaultItems() Then
			NotifyDescription = New NotifyDescription("OnMappingProcessingCompletion", ThisObject);
			OpenForm("Catalog.DefaultIncomeAndExpenseItems.ListForm", New Structure("FromMapping", True), ThisObject,,,
				,NotifyDescription,FormWindowOpeningMode.LockOwnerWindow);
			CommonClientServer.MessageToUser(Nstr("en = 'Not all items are filled in by default. Please fill it in manually.'; ru = 'Не все статьи заполнились по умолчанию. Заполните их вручную.';pl = 'Nie wszystkie pozycje są wypełnione domyślnie. Wypełnij je ręcznie.';es_ES = 'No todos los artículos se rellenan por defecto. Por favor, rellénelos manualmente.';es_CO = 'No todos los artículos se rellenan por defecto. Por favor, rellénelos manualmente.';tr = 'Tüm öğeler varsayılan olarak doldurulamadı. Lütfen, manuel olarak doldurun.';it = 'Non tutti gli elementi sono compilati da impostazione predefinita. Compilarli manualmente.';de = 'Nicht alle Positionen sind standardmäßig aufgefüllt. Bitte füllen Sie sie manuell auf.'"));
		Else
			Close();
		EndIf;
	EndIf;
	
EndProcedure

&AtClient
Procedure OnMappingProcessingCompletion(Result, AdditionParameters) Export
	
	If TypeOf(Result) = Type("Structure") Then
		If Result.Property("OtherExpenses") And ValueIsFilled(Result.OtherExpenses) Then
			FillInPOSTerminalsExpenseItems(Result.OtherExpenses);
		EndIf;
	EndIf;
	
	Close(True);
	
EndProcedure

&AtClient
Procedure ResetToDefaultCommand(Command)
	FillMapping();
EndProcedure

&AtClient
Procedure CloseCommand(Command)
	
	Exit(False);
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure AddPrefilledIncomeAndExpenseItems()
	
	Query = New Query;
	Query.Text = 
	"SELECT DISTINCT
	|	PrimaryChartOfAccounts.Description AS Description,
	|	MAX(CASE
	|			WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|				THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|			WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|				THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|			WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|				THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|			WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|				THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|			WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|				THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|			WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|				THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|		END) AS IncomeAndExpenseType,
	|	MAX(PrimaryChartOfAccounts.MethodOfDistribution) AS MethodOfDistribution,
	|	MAX(CASE
	|			WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|					OR PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|				THEN TRUE
	|			ELSE FALSE
	|		END) AS IsIncome,
	|	MAX(CASE
	|			WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|					OR PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|					OR PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|					OR PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|					OR PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|				THEN TRUE
	|			ELSE FALSE
	|		END) AS IsExpense
	|FROM
	|	ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		LEFT JOIN Catalog.IncomeAndExpenseItems AS IncomeAndExpenseItems
	|		ON PrimaryChartOfAccounts.Description = IncomeAndExpenseItems.Description
	|			AND (NOT IncomeAndExpenseItems.IsFolder)
	|		LEFT JOIN Catalog.DefaultGLAccounts AS DefaultGLAccounts
	|		ON PrimaryChartOfAccounts.Ref = DefaultGLAccounts.GLAccount
	|WHERE
	|	PrimaryChartOfAccounts.TypeOfAccount IN (VALUE(Enum.GLAccountsTypes.CostOfSales), VALUE(Enum.GLAccountsTypes.Expenses), VALUE(Enum.GLAccountsTypes.IndirectExpenses), VALUE(Enum.GLAccountsTypes.OtherExpenses), VALUE(Enum.GLAccountsTypes.OtherIncome), VALUE(Enum.GLAccountsTypes.Revenue))
	|	AND IncomeAndExpenseItems.Ref IS NULL
	|	AND CASE
	|			WHEN DefaultGLAccounts.Ref IS NULL
	|				THEN TRUE
	|			ELSE DefaultGLAccounts.Ref <> VALUE(Catalog.DefaultGLAccounts.GoodsInTransit)
	|		END
	|
	|GROUP BY
	|	PrimaryChartOfAccounts.Description";
	
	Selection = Query.Execute().Select();
	
	BeginTransaction();
	
	Try
		
		While Selection.Next() Do
			
			CatalogObject = Catalogs.IncomeAndExpenseItems.CreateItem();
			FillPropertyValues(CatalogObject, Selection);
			
			InfobaseUpdate.WriteObject(CatalogObject);
			
		EndDo;
		
		UndefinedElem = Catalogs.IncomeAndExpenseItems.Undefined.GetObject();
		UndefinedElem.IsExpense = True;
		UndefinedElem.IsIncome = True;
		
		InfobaseUpdate.WriteObject(UndefinedElem);
		
		CommitTransaction();
		
	Except
		
		RollbackTransaction();
		
		ErrorDescription = StringFunctionsClientServer.SubstituteParametersToString(
			NStr("en = 'Cannot save catalog ""%1"". Details: %2'; ru = 'Не удалось записать справочник ""%1"". Подробнее: %2';pl = 'Nie można zapisać katalogu ""%1"". Szczegóły: %2';es_ES = 'Ha ocurrido un error al guardar el catálogo ""%1"". Detalles: %2';es_CO = 'Ha ocurrido un error al guardar el catálogo ""%1"". Detalles: %2';tr = '""%1"" kataloğu kaydedilemiyor. Ayrıntılar: %2';it = 'Impossibile salvare il catalogo ""%1"". Dettagli: %2';de = 'Fehler beim Speichern des Katalogs ""%1"". Details: %2'", CommonClientServer.DefaultLanguageCode()),
			Object,
			BriefErrorDescription(ErrorInfo()));
		
		WriteLogEvent(
			InfobaseUpdate.EventLogEvent(),
			EventLogLevel.Error,
			Metadata.Catalogs.IncomeAndExpenseItems,
			,
			ErrorDescription);
		
		Return;
		
	EndTry;
	
EndProcedure

&AtServer
Procedure FormManagement()
	
	Items.ProcessDataCommand.Enabled = IsEachGLAccoutMapped();
	
	ErrorRows = Mapping.FindRows(New Structure("IncomeAndExpenseItem", PredefinedValue("Catalog.IncomeAndExpenseItems.EmptyRef")));
	
	Items.ProcessDataCommand.Enabled = (ErrorRows.Count() = 0);
	
	If Constants.EachGLAccountIsMappedToIncomeAndExpenseItem.Get() Then
		Items.DecorationDescription.Title =
			NStr("en = 'Since release 1.4.1, instead of GL accounts, income and expense items will be applied for the profit estimation of Sales orders.
				|Please map GL accounts to income and expense items. Otherwise, you will not be able to work with 1C:Drive.'; 
				|ru = 'Начиная с версии 1.4.1, для оценки прибыльности заказов покупателей вместо счетов учета будут применяться статьи доходов и расходов.
				|Необходимо сопоставить счета учета со статьями доходов и расходов. В противном случае вы не сможете работать с 1C:Drive.';
				|pl = 'Zaczynając od wydania 1.4.1, zamiast kont księgowych, do szacowania zysków Zamówień sprzedaży będą stosowane pozycje rozchodów i dochodów.
				|Zmapuj konta księgowe do pozycji dochodów i rozchodów. W przeciwnym razie nie można będzie pracować z 1C:Drive.';
				|es_ES = 'Desde la versión 1.4.1, en lugar de las cuentas del libro mayor, se aplicarán las partidas de ingresos y gastos para la estimación de beneficios de los pedidos de ventas. 
				|Por favor, asigne las cuentas del libro mayor a las partidas de ingresos y gastos. De lo contrario, no podrá trabajar con 1C:Drive.';
				|es_CO = 'Desde la versión 1.4.1, en lugar de las cuentas del libro mayor, se aplicarán las partidas de ingresos y gastos para la estimación de beneficios de los pedidos de ventas. 
				|Por favor, asigne las cuentas del libro mayor a las partidas de ingresos y gastos. De lo contrario, no podrá trabajar con 1C:Drive.';
				|tr = '1.4.1 sürümünden itibaren Satış siparişlerinin kar tahmini için Muhasebe hesapları yerine gelir ve gider kalemleri uygulanacak.
				|Lütfen, Muhasebe hesaplarını gelir ve gider kalemleriyle eşleştirin. Aksi takdirde, 1C:Drive ile çalışamazsınız.';
				|it = 'Dalla versione 1.4.1, invece dei conti mastro, le voci di entrata e uscita saranno applicate per la stima dell''utile degli Ordini cliente. 
				|Mappare i conti mastro in voci di entrata e uscita, altrimenti non sarà possibile lavorare con 1C:Drive.';
				|de = 'Seit Freigabe 1.4.1, werden Positionen von Einnahmen und Ausgaben statt Hauptbuch-Konten für die Gewinnschätzung von Kundenaufträgen verwendet.
				|Bitte mappen Sie Hauptbuch-Konten zu Positionen Einnahmen und Ausgaben. Sonst können Sie nicht mit 1C:Drive arbeiten.'");
	EndIf;
	
EndProcedure

&AtServer
Function IsEachGLAccoutMapped()
	
	MappingTable = GetMappingTable();
	
	If MappingTable.Count() = 0 Then
		Return True;
	EndIf;
	
	Return MappingTable.Find(Catalogs.IncomeAndExpenseItems.EmptyRef(), "IncomeAndExpenseItem") = Undefined;
	
EndFunction

&AtServer
Procedure FillMapping()
	
	Mapping.Load(GetMappingTable());
	
EndProcedure

&AtServer
Procedure FillProfitEstimationMapping()
	
	Mapping.Load(GetProfitEstimationMappingTable());
	
EndProcedure

&AtServer
Function GetMappingTable()
	
	TempTablesManager = New TempTablesManager;
	
	Query = New Query;
	Query.TempTablesManager = TempTablesManager;
	
	Query.Text =
	"SELECT DISTINCT
	|	IncomeAndExpenses.GLAccount AS GLAccount,
	|	PrimaryChartOfAccounts.Description AS Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END AS IncomeAndExpenseType,
	|	UNDEFINED AS IsIncome
	|INTO TT_GLAccounts
	|FROM
	|	AccumulationRegister.IncomeAndExpenses AS IncomeAndExpenses
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON IncomeAndExpenses.GLAccount = PrimaryChartOfAccounts.Ref
	|			AND (IncomeAndExpenses.GLAccount <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	IncomeAndExpensesBudget.GLAccount,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	UNDEFINED
	|FROM
	|	AccumulationRegister.IncomeAndExpensesBudget AS IncomeAndExpensesBudget
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON IncomeAndExpensesBudget.GLAccount = PrimaryChartOfAccounts.Ref
	|			AND (IncomeAndExpensesBudget.GLAccount <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	FixedAssetParameters.GLExpenseAccount,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	UNDEFINED
	|FROM
	|	InformationRegister.FixedAssetParameters AS FixedAssetParameters
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON FixedAssetParameters.GLExpenseAccount = PrimaryChartOfAccounts.Ref
	|			AND (FixedAssetParameters.GLExpenseAccount <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	FinancialResult.GLAccount,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	UNDEFINED
	|FROM
	|	AccumulationRegister.FinancialResult AS FinancialResult
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON FinancialResult.GLAccount = PrimaryChartOfAccounts.Ref
	|			AND (FinancialResult.GLAccount <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	FinancialResultForecast.GLAccount,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	UNDEFINED
	|FROM
	|	AccumulationRegister.FinancialResultForecast AS FinancialResultForecast
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON FinancialResultForecast.GLAccount = PrimaryChartOfAccounts.Ref
	|			AND (FinancialResultForecast.GLAccount <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	CompensationPlan.GLExpenseAccount,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	UNDEFINED
	|FROM
	|	InformationRegister.CompensationPlan AS CompensationPlan
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON CompensationPlan.GLExpenseAccount = PrimaryChartOfAccounts.Ref
	|			AND (CompensationPlan.GLExpenseAccount <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	WriteOffCostAdjustment.GLAccount,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	UNDEFINED
	|FROM
	|	InformationRegister.WriteOffCostAdjustment AS WriteOffCostAdjustment
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON WriteOffCostAdjustment.GLAccount = PrimaryChartOfAccounts.Ref
	|			AND (WriteOffCostAdjustment.GLAccount <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	EarningAndDeductionTypes.GLExpenseAccount,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	UNDEFINED
	|FROM
	|	Catalog.EarningAndDeductionTypes AS EarningAndDeductionTypes
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON EarningAndDeductionTypes.GLExpenseAccount = PrimaryChartOfAccounts.Ref
	|			AND (EarningAndDeductionTypes.GLExpenseAccount <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	CounterpartiesGLAccounts.DiscountAllowed,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	UNDEFINED
	|FROM
	|	InformationRegister.CounterpartiesGLAccounts AS CounterpartiesGLAccounts
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON CounterpartiesGLAccounts.DiscountAllowed = PrimaryChartOfAccounts.Ref
	|			AND (CounterpartiesGLAccounts.DiscountAllowed <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	CounterpartiesGLAccounts.DiscountReceived,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	UNDEFINED
	|FROM
	|	InformationRegister.CounterpartiesGLAccounts AS CounterpartiesGLAccounts
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON CounterpartiesGLAccounts.DiscountReceived = PrimaryChartOfAccounts.Ref
	|			AND (CounterpartiesGLAccounts.DiscountReceived <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	ProductGLAccounts.Revenue,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	UNDEFINED
	|FROM
	|	InformationRegister.ProductGLAccounts AS ProductGLAccounts
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON ProductGLAccounts.Revenue = PrimaryChartOfAccounts.Ref
	|			AND (ProductGLAccounts.Revenue <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	ProductGLAccounts.COGS,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	UNDEFINED
	|FROM
	|	InformationRegister.ProductGLAccounts AS ProductGLAccounts
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON ProductGLAccounts.COGS = PrimaryChartOfAccounts.Ref
	|			AND (ProductGLAccounts.COGS <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	ProductGLAccounts.SalesReturn,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	UNDEFINED
	|FROM
	|	InformationRegister.ProductGLAccounts AS ProductGLAccounts
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON ProductGLAccounts.SalesReturn = PrimaryChartOfAccounts.Ref
	|			AND (ProductGLAccounts.SalesReturn <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	ProductGLAccounts.PurchaseReturn,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	UNDEFINED
	|FROM
	|	InformationRegister.ProductGLAccounts AS ProductGLAccounts
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON ProductGLAccounts.PurchaseReturn = PrimaryChartOfAccounts.Ref
	|			AND (ProductGLAccounts.PurchaseReturn <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	ProductGLAccounts.CostOfSales,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	UNDEFINED
	|FROM
	|	InformationRegister.ProductGLAccounts AS ProductGLAccounts
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON ProductGLAccounts.CostOfSales = PrimaryChartOfAccounts.Ref
	|			AND (ProductGLAccounts.CostOfSales <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	DefaultGLAccounts.GLAccount,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	FALSE
	|FROM
	|	Catalog.DefaultGLAccounts AS DefaultGLAccounts
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON DefaultGLAccounts.GLAccount = PrimaryChartOfAccounts.Ref
	|			AND (DefaultGLAccounts.GLAccount <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|			AND (DefaultGLAccounts.Ref = VALUE(Catalog.DefaultGLAccounts.CommissionExpensesOnLoansBorrowed))
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	DefaultGLAccounts.GLAccount,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	TRUE
	|FROM
	|	Catalog.DefaultGLAccounts AS DefaultGLAccounts
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON DefaultGLAccounts.GLAccount = PrimaryChartOfAccounts.Ref
	|			AND (DefaultGLAccounts.GLAccount <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|			AND (DefaultGLAccounts.Ref = VALUE(Catalog.DefaultGLAccounts.CommissionIncomeOnLoansLent))
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	SalesOrderEstimate.Products,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	UNDEFINED
	|FROM
	|	Document.SalesOrder.Estimate AS SalesOrderEstimate
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON SalesOrderEstimate.Products = PrimaryChartOfAccounts.Ref
	|			AND (SalesOrderEstimate.Products <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|
	|UNION ALL
	|
	|SELECT
	|	Inventory.GLAccount,
	|	PrimaryChartOfAccounts.Description,
	|	VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads),
	|	FALSE
	|FROM
	|	AccumulationRegister.Inventory AS Inventory
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON Inventory.GLAccount = PrimaryChartOfAccounts.Ref
	|			AND (Inventory.GLAccount <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|			AND (PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses))
	|
	|UNION ALL
	|
	|SELECT
	|	Inventory.CorrGLAccount,
	|	PrimaryChartOfAccounts.Description,
	|	VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads),
	|	FALSE
	|FROM
	|	AccumulationRegister.Inventory AS Inventory
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON Inventory.CorrGLAccount = PrimaryChartOfAccounts.Ref
	|			AND (Inventory.CorrGLAccount <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))
	|			AND (PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses))
	|
	|UNION ALL
	|
	|SELECT
	|	PrimaryChartOfAccounts.Ref,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	UNDEFINED
	|FROM
	|	ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|WHERE
	|	PrimaryChartOfAccounts.FinancialStatement = VALUE(Enum.FinancialStatement.ProfitAndLossStatement)
	|	AND PrimaryChartOfAccounts.TypeOfAccount IN (VALUE(Enum.GLAccountsTypes.CostOfSales), VALUE(Enum.GLAccountsTypes.Expenses), VALUE(Enum.GLAccountsTypes.IndirectExpenses), VALUE(Enum.GLAccountsTypes.OtherExpenses), VALUE(Enum.GLAccountsTypes.OtherIncome), VALUE(Enum.GLAccountsTypes.Revenue))
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	SalesOrderEstimate.Products,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	UNDEFINED
	|FROM
	|	Document.SalesOrder.Estimate AS SalesOrderEstimate
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON SalesOrderEstimate.Products = PrimaryChartOfAccounts.Ref";
	
	// begin Drive.FullVersion
	Query.Text = Query.Text + DriveClientServer.GetQueryUnion() + "
	|
	|SELECT DISTINCT
	|	PredeterminedOverheadRates.OverheadsGLAccount,
	|	PrimaryChartOfAccounts.Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END,
	|	UNDEFINED
	|FROM
	|	InformationRegister.PredeterminedOverheadRates AS PredeterminedOverheadRates
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON PredeterminedOverheadRates.OverheadsGLAccount = PrimaryChartOfAccounts.Ref
	|			AND (PredeterminedOverheadRates.OverheadsGLAccount <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef))";
	// end Drive.FullVersion
	
	Query.Execute();
	
	Query.Text =
	"SELECT DISTINCT
	|	TT_GLAccounts.GLAccount AS GLAccount,
	|	ISNULL(MappingGLAccountsToIncomeAndExpenseItemsSliceLast.IncomeAndExpenseItem, ISNULL(IncomeAndExpenseItems.Ref, VALUE(Catalog.IncomeAndExpenseItems.Undefined))) AS IncomeAndExpenseItem,
	|	CASE
	|		WHEN ISNULL(MappingGLAccountsToIncomeAndExpenseItemsSliceLast.IncomeAndExpenseItem, ISNULL(IncomeAndExpenseItems.Ref, VALUE(Catalog.IncomeAndExpenseItems.Undefined))) = VALUE(Catalog.IncomeAndExpenseItems.Undefined)
	|			THEN 0
	|		ELSE 1
	|	END AS Order,
	|	&ViewDocuments AS ViewDocuments
	|FROM
	|	TT_GLAccounts AS TT_GLAccounts
	|		LEFT JOIN Catalog.IncomeAndExpenseItems AS IncomeAndExpenseItems
	|		ON TT_GLAccounts.Description = IncomeAndExpenseItems.Description
	|			AND TT_GLAccounts.IncomeAndExpenseType = IncomeAndExpenseItems.IncomeAndExpenseType
	|			AND (CASE
	|				WHEN TT_GLAccounts.IsIncome = UNDEFINED
	|					THEN TRUE
	|				ELSE TT_GLAccounts.IsIncome = IncomeAndExpenseItems.IsIncome
	|			END)
	|		LEFT JOIN InformationRegister.MappingGLAccountsToIncomeAndExpenseItems.SliceLast AS MappingGLAccountsToIncomeAndExpenseItemsSliceLast
	|		ON TT_GLAccounts.GLAccount = MappingGLAccountsToIncomeAndExpenseItemsSliceLast.GLAccount
	|
	|ORDER BY
	|	Order,
	|	TT_GLAccounts.GLAccount.Order";
	
	Query.SetParameter("ViewDocuments", NStr("en = 'View documents...'; ru = 'Просмотреть документы...';pl = 'Wyświetl dokumenty...';es_ES = 'Visualización de documentos...';es_CO = 'Visualización de documentos...';tr = 'Belgeleri görüntüle...';it = 'Visualizzazione documenti...';de = 'Dokumenten anzeigen...'"));
	
	Return Query.Execute().Unload();
	
EndFunction

&AtServer
Function GetProfitEstimationMappingTable()
	
	Query = New Query;
	Query.Text =
	"SELECT DISTINCT
	|	SalesOrderEstimate.Products AS GLAccount,
	|	PrimaryChartOfAccounts.Description AS Description,
	|	CASE
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfSales)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.CostOfSales)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.AdministrativeExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.IndirectExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.ManufacturingOverheads)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherExpenses)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherIncome)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.OtherIncome)
	|		WHEN PrimaryChartOfAccounts.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Revenue)
	|			THEN VALUE(Catalog.IncomeAndExpenseTypes.Revenue)
	|	END AS IncomeAndExpenseType,
	|	UNDEFINED AS IsIncome
	|INTO TT_GLAccounts
	|FROM
	|	Document.SalesOrder.Estimate AS SalesOrderEstimate
	|		INNER JOIN ChartOfAccounts.PrimaryChartOfAccounts AS PrimaryChartOfAccounts
	|		ON SalesOrderEstimate.Products = PrimaryChartOfAccounts.Ref
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT DISTINCT
	|	TT_GLAccounts.GLAccount AS GLAccount,
	|	ISNULL(MappingGLAccountsToIncomeAndExpenseItemsSliceLast.IncomeAndExpenseItem, ISNULL(IncomeAndExpenseItems.Ref, VALUE(Catalog.IncomeAndExpenseItems.Undefined))) AS IncomeAndExpenseItem,
	|	CASE
	|		WHEN ISNULL(MappingGLAccountsToIncomeAndExpenseItemsSliceLast.IncomeAndExpenseItem, ISNULL(IncomeAndExpenseItems.Ref, VALUE(Catalog.IncomeAndExpenseItems.Undefined))) = VALUE(Catalog.IncomeAndExpenseItems.Undefined)
	|			THEN 0
	|		ELSE 1
	|	END AS Order,
	|	&ViewDocuments AS ViewDocuments
	|FROM
	|	TT_GLAccounts AS TT_GLAccounts
	|		LEFT JOIN Catalog.IncomeAndExpenseItems AS IncomeAndExpenseItems
	|		ON TT_GLAccounts.Description = IncomeAndExpenseItems.Description
	|			AND TT_GLAccounts.IncomeAndExpenseType = IncomeAndExpenseItems.IncomeAndExpenseType
	|			AND (CASE
	|				WHEN TT_GLAccounts.IsIncome = UNDEFINED
	|					THEN TRUE
	|				ELSE TT_GLAccounts.IsIncome = IncomeAndExpenseItems.IsIncome
	|			END)
	|		LEFT JOIN InformationRegister.MappingGLAccountsToIncomeAndExpenseItems.SliceLast AS MappingGLAccountsToIncomeAndExpenseItemsSliceLast
	|		ON TT_GLAccounts.GLAccount = MappingGLAccountsToIncomeAndExpenseItemsSliceLast.GLAccount
	|
	|ORDER BY
	|	Order,
	|	TT_GLAccounts.GLAccount.Order";
	
	Query.SetParameter("ViewDocuments", NStr("en = 'View documents...'; ru = 'Просмотреть документы...';pl = 'Wyświetl dokumenty...';es_ES = 'Visualización de documentos...';es_CO = 'Visualización de documentos...';tr = 'Belgeleri görüntüle...';it = 'Visualizzazione documenti...';de = 'Dokumenten anzeigen...'"));
	
	Return Query.Execute().Unload();
	
EndFunction

&AtServer
Function SaveMappingAtServer()
	
	ExecutionParameters = TimeConsumingOperations.BackgroundExecutionParameters(UUID);
	ExecutionParameters.BackgroundJobDescription = NStr("en = 'Data processing...'; ru = 'Обработка данных...';pl = 'Przetwarzanie danych...';es_ES = 'Procesamiento de datos...';es_CO = 'Procesamiento de datos...';tr = 'Veri işleniyor...';it = 'Elaborazione dati...';de = 'Datenverarbeitung...'");
	
	If Constants.EachGLAccountIsMappedToIncomeAndExpenseItem.Get() Then
		
		ProcedureParameters = New Structure;
		ProcedureParameters.Insert("MappingTable", Mapping.Unload());
		
		Return TimeConsumingOperations.ExecuteInBackground(
			"DataProcessors.MappingGLAccountsToIncomeAndExpenseItems.SaveProfitEstimationMapping",
			ProcedureParameters, 
			ExecutionParameters);
		
	EndIf;
	
	ProcedureParameters = New Structure;
	ProcedureParameters.Insert("UseDefaultTypeOfAccounting", UseDefaultTypeOfAccounting);
	ProcedureParameters.Insert("MappingTable", Mapping.Unload());
	
	Return TimeConsumingOperations.ExecuteInBackground(
		"DataProcessors.MappingGLAccountsToIncomeAndExpenseItems.SaveMapping",
		ProcedureParameters, 
		ExecutionParameters);
	
EndFunction

&AtServerNoContext
Procedure SetConstantValues(UseDefaultTypeOfAccounting = Undefined)
	
	If UseDefaultTypeOfAccounting <> Undefined Then
		Constants.UseDefaultTypeOfAccounting.Set(UseDefaultTypeOfAccounting);
	EndIf;
	
EndProcedure

&AtServerNoContext
Function IsEmptyDefaultItems()
	
	Query = New Query;
	Query.Text = "SELECT TOP 1
	|	DefaultIncomeAndExpenseItems.Ref AS Ref
	|FROM
	|	Catalog.DefaultIncomeAndExpenseItems AS DefaultIncomeAndExpenseItems
	|WHERE
	|	DefaultIncomeAndExpenseItems.IncomeAndExpenseItem = VALUE(Catalog.IncomeAndExpenseItems.EmptyRef)";
	
	Return Not Query.Execute().IsEmpty();
	
EndFunction

&AtServerNoContext
Procedure FillInPOSTerminalsExpenseItems(OtherExpenses)
	
	Query = New Query;
	Query.Text = "SELECT
	|	POSTerminals.Ref AS Ref
	|FROM
	|	Catalog.POSTerminals AS POSTerminals
	|WHERE
	|	NOT POSTerminals.DeletionMark
	|	AND POSTerminals.ExpenseItem = VALUE(Catalog.IncomeAndExpenseItems.EmptyRef)";
	
	Selection = Query.Execute().Select();
	While Selection.Next() Do
		POS = Selection.Ref.GetObject();
		POS.ExpenseItem = OtherExpenses;
		InfobaseUpdate.WriteObject(POS);
	EndDo;
	
EndProcedure

#EndRegion
